function randomData() {
  return Math.round(Math.random() * 500);
}

export const mapData = [
  { name: '北京', value: '100' }, { name: '天津', value: randomData() },
  { name: '上海', value: randomData() }, { name: '重庆', value: randomData() },
  { name: '河北', value: randomData() }, { name: '河南', value: randomData() },
  { name: '云南', value: randomData() }, { name: '辽宁', value: randomData() },
  { name: '黑龙江', value: randomData() }, { name: '湖南', value: randomData() },
  { name: '安徽', value: randomData() }, { name: '山东', value: randomData() },
  { name: '新疆', value: randomData() }, { name: '江苏', value: randomData() },
  { name: '浙江', value: randomData() }, { name: '江西', value: randomData() }

];

export const provinceSale = [
  {"name":"安徽","value":1281924.04},
  {"name":"北京","value":1740834.61},
  {"name":"福建","value":1527851.97},
  {"name":"甘肃","value":1263797.84},
  {"name":"广东","value":1897525.56},
  {"name":"广西","value":942419.38},
  {"name":"贵州","value":903811.1},
  {"name":"海南","value":891996.77},
  {"name":"河北","value":956542.16},
  {"name":"河南","value":806524.49},
  {"name":"黑龙江","value":766534.02},
  {"name":"湖北","value":778046.06},
  {"name":"湖南","value":1437962.33},
  {"name":"吉林","value":1103217.26},
  {"name":"江苏","value":1331694.44},
  {"name":"江西","value":910583.23},
  {"name":"辽宁","value":1417750.03},
  {"name":"内蒙古","value":1139955.46},
  {"name":"宁夏","value":797518.77},
  {"name":"青海","value":632022.57},
  {"name":"山东","value":1231800.22},
  {"name":"山西","value":536195.23},
  {"name":"陕西","value":592725.6},
  {"name":"上海","value":1813714.79},
  {"name":"四川","value":1014240.54},
  {"name":"天津","value":1278654.56},
  {"name":"西藏","value":692687.19},
  {"name":"新疆","value":1084279.21},
  {"name":"云南","value":887189.6},
  {"name":"浙江","value":1263946.23},
  {"name":"重庆","value":786951.66}
]

export const geoCoordMap = {
  '上海': [121.4648,31.2891],
  '新疆': [87.9236,43.5883],
  '甘肃': [103.5901,36.3043],
  '总部': [70.4551,50.2539],
  '北京': [116.4551,40.2539],
  '江苏': [118.8062,31.9208],
  '广西': [108.479,23.1152],
  '江西': [116.0046,28.6633],
  '安徽': [117.29,32.0581],
  '内蒙古': [111.4124,40.4901],
  '黑龙江': [127.9688,45.368],
  '天津': [117.4219,39.4189],
  '山西': [112.3352,37.9413],
  '广东': [113.5107,23.2196],
  '四川': [103.9526,30.7617],
  '西藏': [91.1865,30.1465],
  '云南': [102.9199,25.4663],
  '浙江': [119.5313,29.8773],
  '湖北': [114.3896,30.6628],
  '辽宁': [123.1238,42.1216],
  '山东': [117.1582,36.8701],
  '海南': [110.3893,19.8516],
  '河北': [114.4995,38.1006],
  '福建': [119.4543,25.9222],
  '青海': [101.4038,36.8207],
  '陕西': [109.1162,34.2004],
  '贵州': [106.6992,26.7682],
  '河南': [113.4668,34.6234],
  '重庆': [107.7539,30.1904],
  '宁夏': [106.3586,38.1775],
  '吉林': [125.8154,44.2584],
  '湖南': [113.0823,28.2568]
  }